<template>
  <div :class="color">
    <svg :width="width" :height="height" viewBox="0 0 49 42" fill="none" xmlns="http://www.w3.org/2000/svg">
      <path
        d="M23.0638 40.5V20.5244C23.0638 15.271 18.7772 11.0122 13.4894 11.0122H11.5745C6.28664 11.0122 2 15.271 2 20.5244V40.5H23.0638ZM23.0638 40.5H44.1277C45.714 40.5 47 38.508 47 36.9319V20.5244C47 15.2709 42.7134 11.0122 37.4255 11.0122H36.4681M13.0106 11.0122H24.5M16.1164 21.7268C15.5698 20.4683 14.1713 19.5732 12.5322 19.5732C10.8932 19.5732 9.49458 20.4683 8.94803 21.7268M29.766 25.7561V13.3902M29.766 13.3902V3.40244C29.766 2.35175 30.6233 1.5 31.6809 1.5H32.1596C33.2171 1.5 34.0745 2.35175 34.0745 3.40244V8.32174C34.0745 8.8263 33.8727 9.31019 33.5136 9.66697L29.766 13.3902Z"
        stroke="currentColor"
        stroke-width="3"
        stroke-linecap="round" />
    </svg>
  </div>
</template>

<script setup>
defineProps({
  width: {
    type: [String, Number],
    default: 110, // مقدار پیش‌فرض عرض
  },
  height: {
    type: [String, Number],
    default: 121, // مقدار پیش‌فرض ارتفاع
  },
});
</script>

<style></style>
